src/main/resources/finalize_eventi_soap_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:arc="http://arca.inps.it/ArcaNotificaEventiWS/">
    <soapenv:Header>
        <inps:Identity xmlns:inps="http://inps.it/">
            <AppName>%s</AppName>
            <AppKey>%s</AppKey>
            <UserId>%s</UserId>
            <IdentityProvider>%s</IdentityProvider>
        </inps:Identity>
    </soapenv:Header>
    <soapenv:Body>
        <arc:notificaEventiCompletaRequest>
            <notificaEventiCompletaRequest>
                <parametriApplicazione>
                    <codiceArchivio>%s</codiceArchivio>
                    <progetto>%s</progetto>
                </parametriApplicazione>
                <listaEventi>
                    <eventiArcaCompleta>
                        %s
                    </eventiArcaCompleta>
                </listaEventi>
            </notificaEventiCompletaRequest>
        </arc:notificaEventiCompletaRequest>
    </soapenv:Body>
</soapenv:Envelope>
